/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_control_var.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/06/10 09:47:04 by marvin            #+#    #+#             */
/*   Updated: 2019/06/10 09:47:04 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

void	ft_control_var(char *buf_printf, va_list format, char *type)
{
	if (ft_strchr(NUM_INT, g_spec.mod))
	{
		printf("%lld", ft_num_int(format, type));
		//?Заходим в ф-ию определение длинны целых чисел
		//?Или определяем полную точность формата
	}
	// else if (ft_strchr(NUM_DOUBLE, g_spec.mod))
	// {
	// 	//?Заходим в ф-ию определения длинны вещественных чисел
	// 	//?Или определяем полную точность формата
	// }
	// else if (ft_strchr(NUM_OTHER, g_spec.mod))
	// {
	// 	//?Тут еще подумаю
	// }
}