																		/**** Моя документация по libft *****/
--------------------------------------------------------------------------------------|
void				*ft_memset(void	*buf, int value, size_t num);					  |
/*	Заполняет каждый байт области памяти buf значением лежащим в value. Кол-во		*/|
/*	байт которые необходимо заполнить лежит в num.									*/|
--------------------------------------------------------------------------------------|
void				ft_bzero(void *s, size_t n);									  |
/*	Обнуляет область памяти s до n-ого байта										*/|
--------------------------------------------------------------------------------------|
void				*ft_memcpy(void *dest, const void *src, size_t n);				  |
/*	Побайтовая замена из src в dest размером n										*/|
--------------------------------------------------------------------------------------|
void				*ft_memccpy(void *dest, const void *src, int ch, size_t n);		  |
/*	
--------------------------------------------------------------------------------------|
void				*ft_memmove(void *dest, const void *src, size_t n);
--------------------------------------------------------------------------------------|
void				*ft_memchr(const void *s, int c, size_t n);
--------------------------------------------------------------------------------------|
int					ft_memcmp(const void *s1, const void *s2, size_t n);
--------------------------------------------------------------------------------------|
size_t				ft_strlen(const char *str);										  |
/* Считает кол-во символов в строке без учета нуль символа						    */|
------------------------------------------------------------------------------------  |
char				*ft_strdup(const char *s);										  |
/*	Выделяет динамическую память размером строки s и копирует туда содержимое		*/|
/*	вместе с нуль символом															*/|
--------------------------------------------------------------------------------------|
char				*ft_strcpy(char *dest, const char *src);						  |
/*	Копирует содержимое строки src в dest пока не закончится размер dest			*/|
--------------------------------------------------------------------------------------|
char				*ft_strncpy(char *dest, const char *src, size_t n);				  |
/*	Копирует содержимое строки src в dest до введенного размера n					*/|
--------------------------------------------------------------------------------------|
char				*ft_strcat(char *dest, const char *src);						  |
/*	Конкатенирует строку src к строке dest											*/|
--------------------------------------------------------------------------------------|
char				*ft_strncat(char *dest, const char *src, size_t n);				  |
/*	Конкатенирует строку src в dest до введенного размера n							*/|
--------------------------------------------------------------------------------------|
size_t				ft_strlcat(char *dst, const char *src, size_t size);			  |
/*	Конкатенирует строку src в dst, где size-размер получаемой строки после			*/|
/*	склеивания																		*/|
--------------------------------------------------------------------------------------|
char				*ft_strchr(const char *s, int c);								  |
/*	Функция ft_strchr выполняет поиск первого вхождения символа с в строку string.	*/|
/*	Возвращает указатель на первое вхождение символа в строке. Завершающий нулевой	*/|
/*	символ считается частью Си-строки. Таким образом, он также может быть найден	*/|
/*	для получения указателя на конец строки											*/|
--------------------------------------------------------------------------------------|
char				*ft_strrchr(const char *s, int c);								  |
/*	Функция ищет последнее вхождение символа c в строку string.						*/|
/*	Возвращает указатель на последнее вхождение символа в строке string.			*/|
/*	Завершающий нулевой символ считается частью строки.								*/|
/*	Таким образом, он также может быть найден для получения							*/|
/*	указателя на конец строки														*/|
--------------------------------------------------------------------------------------|
char				*ft_strstr(const char *haystack, const char *needle);			  |
/*	Функция ищет первое вхождение подстроки needle в строке haystack.				*/|
/*	Возвращает указатель на первое вхождение строки needle   в строку haystack,		*/|
/*	или пустой указатель, если строка needle не является частью строки haystack.	*/|
/*	В данном поиске нуль-символ не  учитывается										*/|
--------------------------------------------------------------------------------------|
char				*ft_strnstr(const char *big, const char *little, size_t len);	  |
/*	Ищет первое вхождение подстроки little в строке big, поиск идет до len символов */|
/*	big строки. Возвращает вхождение строки или ноль, если строка не вошла.			*/|
--------------------------------------------------------------------------------------|
int					ft_strcmp(const char *s1, const char *s2);						  |
/*	Сравнивает лексиграфически две строки. Возвращает значение меньше нуля, если	*/|
/*	вторая строка больше первой, больше нуля если первая больше второй и нуль, если */|
/*	cтроки равны.																	*/|
--------------------------------------------------------------------------------------|
int					ft_strncmp(const char *s1, const char *s, size_t n);			  |
/*	Работает как ft_strcmp, отличие в том что сравнение идет до n-ого символа		*/|
--------------------------------------------------------------------------------------|
int					ft_atoi(const char *nptr);										  |
/*	Функция atoi преобразует строку string в целое значение типа int.				*/|
/*	Анализируя строку string, atoi интерпретирует её содержание, как целое число,	*/|
/*	которое возвращается как int. Функция сначала отбрасывает символы пробелов		*/|
/*	до тех пор, пока не будет найден символ отличный от нуля.						*/|
/*	Затем, начиная с этого символа, функция принимает необязательный начальный знак */|
/*	плюс или минус. После чего, следует  последовательность цифр, которая			*/|
/*	интерпретируется в числовое значение.											*/|
/*	Строка может содержать другие символы после считанного целого числа,			*/|
/*	эти символы игнорируются и никак не влияют на поведение этой функции.			*/|
/*	Если первая последовательность не-пробельных символов в строке string			*/|
/*	не является целым числом, или, если string пустая  или содержит					*/|
/*	только пробельные символы, преобразование не выполняется.						*/|
--------------------------------------------------------------------------------------|
int					ft_isalpha(int c);
--------------------------------------------------------------------------------------|
int					ft_isdigit(int c);
--------------------------------------------------------------------------------------|
int					ft_isalnum(int c);
--------------------------------------------------------------------------------------|
int					ft_isascii(int c);
--------------------------------------------------------------------------------------|
int					ft_isprint(int c);
--------------------------------------------------------------------------------------|
int					ft_toupper(int c);
--------------------------------------------------------------------------------------|
int					ft_tolower(int c);
--------------------------------------------------------------------------------------|
char				*ft_strnew(size_t size);
--------------------------------------------------------------------------------------|
void				ft_strdel(char **as);
--------------------------------------------------------------------------------------|
void				ft_strclr(char *s);
--------------------------------------------------------------------------------------|
void				ft_striter(char *s, void (*f)(char *));
--------------------------------------------------------------------------------------|
void				*ft_memalloc(size_t size);
--------------------------------------------------------------------------------------|
void				ft_memdel(void **ap);
--------------------------------------------------------------------------------------|
int					ft_isspace(int c);
--------------------------------------------------------------------------------------|
void				ft_striteri(char *s, void (*f)(unsigned int, char *));
--------------------------------------------------------------------------------------|
char				*ft_strmap(char const *s, char (*f)(char));
--------------------------------------------------------------------------------------|
char				*ft_strmapi(char const *s, char (*f)(unsigned int, char));
--------------------------------------------------------------------------------------|
int					ft_strequ(char const *s1, char const *s2);
--------------------------------------------------------------------------------------|
int					ft_strnequ(char const *s1, char const *s2, size_t n);
--------------------------------------------------------------------------------------|
char				*ft_strsub(char const *s, unsigned int start, size_t len);
--------------------------------------------------------------------------------------|
char				*ft_strjoin(char const *s1, char const *s2);
--------------------------------------------------------------------------------------|
char				*ft_strtrim(char const *s);
--------------------------------------------------------------------------------------|
char				**ft_strsplit(char const *s, char c);
--------------------------------------------------------------------------------------|
int					ft_pow(int n, int level);
--------------------------------------------------------------------------------------|
int					ft_revers(int n);
--------------------------------------------------------------------------------------|
char				*ft_itoa(int n);
--------------------------------------------------------------------------------------|
void				ft_putchar(char c);
--------------------------------------------------------------------------------------|
void				ft_putstr(char const *s);
--------------------------------------------------------------------------------------|
void				ft_putnbr(int n);
--------------------------------------------------------------------------------------|
void				ft_putendl(char const *s);
--------------------------------------------------------------------------------------|
void				ft_putchar_fd(char c, int fd);
--------------------------------------------------------------------------------------|
void				ft_putstr_fd(char const *s, int fd);
--------------------------------------------------------------------------------------|
void				ft_putendl_fd(char const *s, int fd);
--------------------------------------------------------------------------------------|
void				ft_putnbr_fd(int n, int fd);
--------------------------------------------------------------------------------------|
t_list				*ft_lstnew(void const *content, size_t content_size);
--------------------------------------------------------------------------------------|
void				ft_lstdelone(t_list **alst, void (*del)(void *, size_t));
--------------------------------------------------------------------------------------|
void				ft_lstdel(t_list **alst, void (*del)(void *, size_t));
--------------------------------------------------------------------------------------|
void				ft_lstadd(t_list **alst, t_list *new);
--------------------------------------------------------------------------------------|
void				ft_lstiter(t_list *lst, void (*f)(t_list *elem));
--------------------------------------------------------------------------------------|
void				ft_lstadd_end(t_list **begin_list, t_list *elem);
--------------------------------------------------------------------------------------|
t_list				*ft_lstmap(t_list *lst, t_list *(*f)(t_list *elem));
--------------------------------------------------------------------------------------|

